package Day04.ifDemo;
// 这是一个Java程序，演示了如何使用if语句进行条件判断
import java.util.Scanner;
// 1.导入java.util.Scanner类
public class ifDemo {
    public void main(String[] args){
        //键盘录入
        Scanner sc = new Scanner(System.in);
        //提示用户输入数据
        //System.out.println("请输入一个数：");
        System.out.println("请输入一个数");
        int wine = sc.nextInt();
        //判断输入的数是正数还是负数
        //关闭键盘录入，防止内存泄漏.
        sc.close();

        //判断输入
        //第一个格式
        if (wine > 5) {
            //如果输入的数大于5，输出“已过关”
            System.out.println("已过关");
        }
        //--------------------------------------------------------------------------------------------------
        //格式一；
        //if （关系表达式） {
        //          语句体;
        //}
       //--------------------------------------------------------------------------------------------------
        //注意事项
        //1.大括号的开头可以另起一行书写，建议写在第一行的末尾，
        //2.在语句体在，如果只有一行语句体，可以省略大括号。
        // 3.如果对一个布尔类型进行判断，不要用==，而是用=，因为==是判断两个值是否相等，而=是赋值运算符。
        //
            
        //-----------------------------------------------------------------------------------------
    }
}
