/*  什么是方法(method)=================================================================================================
 * 方法(method)是持续中最小的执行单元
 * 实际开发中什么时候用到方法呢？
 * 
 * 重复的代码，具有独立功能代码可以抽取到方法中
 * 在实际开发中方法有什么好处？
 * 
 * 可以提高代码的复用性
 * 可以提高代码的可维护性
 * ==================================================================================================================
 * 方法的格式
 * 把一些代码打包在一起，用到的时候就调用
 * 方法的定义 把一些代码打包一起，该过程称方法的定义
 * 方法的调用 方法定义后不是直接运行的，需要手动调用才能运行的，该过程称方法的调用
 * =================================================================================================================
 * 最简单的方法定义与调用
 * 方法定义:
 * public static void 方法名 (){
 *      方法体(就是打包的代码);
 * }
 * eg:
 * public static void playGema{
 *      七个打印语句;
 * }
 * 方法的调用:
 * playGema();
 * 注意 方法必须先定义后调用
 * ==========================================================================================================
 * 带参数的方法定义和调用
 * 单个参数的定义
 * public static void 方法名(cshu1)
 */